Revit 2026 API

# PipeFittingAndAccessoryPressureDropData Class

---

The input and output data used by external servers for calculation of the pipe fitting and pipe accessory pressure drop.

SystemObject Autodesk.Revit.DB.PlumbingPipeFittingAndAccessoryPressureDropData

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PipeFittingAndAccessoryPressureDropData : IDisposable
```
```vb
Public Class PipeFittingAndAccessoryPressureDropData
	Implements IDisposable
```
```cpp
public ref class PipeFittingAndAccessoryPressureDropData : IDisposable
```
```fsharp
type PipeFittingAndAccessoryPressureDropData =
    class
        interface IDisposable
    end
```

The PipeFittingAndAccessoryPressureDropData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CalculationType | The calculation type, a bitmask of FittingAndAccessoryCalculationType. |
|  | IsCurrentEntityValid | True if the current settings stored in the entity is valid. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the PipeFittingAndAccessoryPressureDropData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPipeFittingAndAccessoryData | Returns the fitting and accessory information |
|  | GetPresureDropItems | Returns the pressure drop items |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetDefaultEntity | Stores the default entity in the data. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Plumbing Namespace